Tekla Open API Reference for Tekla Structures 2025
Distance.PointToLineSegment Method
 Returns the distance between the given point and line segment.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static double PointToLineSegment(
	Point Point,
	LineSegment LineSegment
)
Public Shared Function PointToLineSegment (
	Point As Point,
	LineSegment As LineSegment
) As Double
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be used.
LineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be used.
Return Value
Type: Double
The distance between the given point and line segment.
See Also
Reference
Distance Class
Tekla.Structures.Geometry3d Namespace